<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"54a28531f807296310d0eb7f265021758f64110da03f456cfad37e021e7e51fd","plan_job_ref":"Job Plan Airflow DAGs #261 at https://github.com/cal-itp/data-infra/actions/runs/16224109596","plan_out_hash":"9434d04a36ab73b259bde122a125f8e27aca5ca308c2969fca374320507d48e8","plan_hash":"9ca1873bcbb7f84907bb56eaf5f26d3e045bc67cb383bfe1ba525101a8110369","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/hooks/kuba_hook.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/hooks/kuba_hook.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/hooks/kuba_hook.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "kRpTXw==" -> (known after apply)
!~      detect_md5hash      = "jB+vU4xZtSXqFNkXlEOFoQ==" -> "different hash"
!~      generation          = 1752191635207770 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jB+vU4xZtSXqFNkXlEOFoQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "LrvsSQ==" -> (known after apply)
!~      detect_md5hash      = "2K7c85e1EMDnxtjky8pXvw==" -> "different hash"
!~      generation          = 1752191636882005 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "2K7c85e1EMDnxtjky8pXvw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #261](https://github.com/cal-itp/data-infra/actions/runs/16224109596)